app/Controllers/Home.php

    public function funcao_para_apresentar_tela_sec(): string
    {
        $data['pessoas'] = $this->pessoasModel->findAll();
---
SELECT *
FROM `pessoas`

    public function funcao_para_processar_formulario()
    {
        $data['nome'] = $this->request->getPost('nome'); // $_POST['nome']
        $data['email'] = $this->request->getPost('email'); // $_POST['email']
        $this->pessoasModel->insert($data);
---
INSERT INTO `pessoas` (`nome`, `email`) VALUES ('Odracir', 'teste@teste.com')

    public function removerPessoa()
    {
        $id = $this->request->getPost('id_para_remover');
        $this->pessoasModel->delete($id);
---
DELETE FROM `pessoas`
WHERE `id` IN ('2')

    public function editarPessoa()
    {
        $id = $this->request->getPost('id_para_editar');
        $pessoa = $this->pessoasModel->find($id); // select * from pessoas where id = $id
---
SELECT *
FROM `pessoas`
WHERE `pessoas`.`id` = '3'

    public function updatePessoa()
    {
        $id = $this->request->getPost('id_para_editar');
        $data['nome'] = $this->request->getPost('nome');
        $data['email'] = $this->request->getPost('email');
        $this->pessoasModel->update($id, $data);
---
UPDATE `pessoas` SET `nome` = 'messi GOAT', `email` = 'messi@arg.ar'
WHERE `pessoas`.`id` IN ('3')